system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.5 0.0 -0.5) //0
    ( 0.5 0.0 -0.5) //1
    ( 0.5 1.0 -0.5) //2
    (-0.5 1.0 -0.5) //3
    (-0.5 0.0  0.5) //4
    ( 0.5 0.0  0.5) //5
    ( 0.5 1.0  0.5) //6
    (-0.5 1.0  0.5) //7

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 50) simpleGrading (1 1 1) //2 cm grid size
);

edges
(
);

boundary
(
    floor
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }

    sides
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (0 1 2 3)
            (1 5 6 2)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
