system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     fireFoam;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         5.0;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.9;

maxDeltaT       0.01;

functions
{
    HRR
    {
        type               volFieldValue;
        libs ("libfieldFunctionObjects.so");
        enabled            true;
        outputInterval     runTime;
        writeInterval      0.01;
        log                false;     
        writeFields     false;
        regionType      all;       
        name            c0;
        operation          volIntegrate;
        fields
        (
            Qdot
        );
    }
}

// ************************************************************************* //
